In [1]:
import pandas as pd
import numpy as np

# Creating DataFrame in Pandas

## Creating DataFrame from an Array

### option 1

In [2]:
# creating an array
data = np.array([[1,4],[2,5],[3,6]])

In [3]:
# creating dataframe 
df = pd.DataFrame(data)
# showing dataframe with assigned values for index and columns
df

   0  1
0  1  4
1  2  5
2  3  6

In [4]:
# here index and columns are variables needs to in same name
df = pd.DataFrame(data, index=['row1', 'row2', 'row3'], columns=['col1', 'col2'])

In [5]:
# showing dataframe
df

      col1  col2
row1     1     4
row2     2     5
row3     3     6

### option 2

In [6]:
#creating array with list shape
data = [[1, 4], [2, 5], [3, 6]]

In [7]:
# creating a dataframe
df = pd.DataFrame(data, index=['row1', 'row2', 'row3'],
                 columns=['col1', 'col2'])

In [8]:
# showing the datafrane
df

      col1  col2
row1     1     4
row2     2     5
row3     3     6

## Creating a dataframe from Dictionary

In [9]:
# lists used from value for dictionary keys
states = ["Andhra Pradesh", "Karnataka", "Telangana","Tamilnadu"]
population = [3904398403,2490240249,209204024,209240220] # random population values

In [10]:
# creating dictionary and storing list in it
dict_states = {"States": states, "Population": population}

In [11]:
# creating dataframe
df_sp = pd.DataFrame(dict_states)
# df_sp = pd,DataFrame.from_dict(dict_states)

In [12]:
# showing the datafrane
df_sp

           States  Population
0  Andhra Pradesh  3904398403
1       Karnataka  2490240249
2       Telangana   209204024
3       Tamilnadu   209240220

## Creating a dataframe from a .csv file

In [13]:
# reading .csv file 
# to read we use .read_csv(filename);
df_data = pd.read_csv('StudentsPerformance.csv')

In [14]:
# show dataframe
df_data

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75
...,...,...,...,...,...,...,...,...
995,female,group E,master's degree,standard,completed,88,99,95
996,male,group C,high school,free/reduced,none,62,55,55
997,female,group C,high school,free/reduced,completed,59,71,65
998,female,group D,some college,standard,completed,68,78,77
999,female,group D,some college,free/reduced,none,77,86,86

In [15]:
# show first 5 rows of dataFrame
df_data.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75

In [16]:
# show last 5 rows of dataFrame
df_data.tail()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
995,female,group E,master's degree,standard,completed,88,99,95
996,male,group C,high school,free/reduced,none,62,55,55
997,female,group C,high school,free/reduced,completed,59,71,65
998,female,group D,some college,standard,completed,68,78,77
999,female,group D,some college,free/reduced,none,77,86,86